ep7/app/controllers/consoles_controller.rb

SELECT "consoles".* FROM "consoles"
---
    def index
        @consoles = Console.all

INSERT INTO "consoles" ("name", "manufacturer", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Playstation Vita"], ["manufacturer", "Sony"], ["created_at", "2023-08-10 14:53:59.116868"], ["updated_at", "2023-08-10 14:53:59.116868"]]
---
    def create
        console = Console.new(console_params)
        console.save